# 1. Числовая цепочка
# Напишите программу, которая выводит числа от 1 до 5 включительно, разделяя их символами “---”. Используйте параметр
# sep.
# Пример вывода:
#   (1---2---3---4---5)

print("1", "2", "3", "4", "5", sep="---")

# 2. Пробельные символы
# Напишите программу, которая выведет две строки: первая строка с табуляцией, вторая — на новой строке с помощью одного
# вызова print().
# Пример вывода:
#   Первая строка с табуляцией
# Вторая строка на новой строке


# text_with_tab = " Первая строка\tс табуляцией\nВторая строка на новой строке"
# print(text_with_tab)
#
# print(" Первая строка\tс табуляцией\nВторая строка на новой строке")
#
# # 3. Текст в кавычках
# # Напишите программу, которая выводит строку "Это файл "example.txt"". Выполните задачу несколькими способами.
# # Пример вывода:
# # Это файл "example.txt"
#
# print("Это файл \"example.txt\"")
# print('Это файл "example.txt"')
# print('''Это файл "example.txt"''')